name: "yolov11_ensemble"
platform: "ensemble"

input [
  {
    name: "IMAGE_BYTES"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [ 1, 84, 8400 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocessor"
      model_version: 1
      input_map {
        key: "IMAGE_BYTES"
        value: "IMAGE_BYTES"
      }
      output_map {
        key: "PREPROCESSED_IMAGE"
        value: "preprocessed_output"
      }
    },
    {
      model_name: "yolov11"
      model_version: 1
      input_map {
        key: "INPUT__0"
        value: "preprocessed_output"
      }
      output_map {
        key: "OUTPUT__0"
        value: "OUTPUT__0"
      }
    }
  ]
}